---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedBuildIssueType.AllFine
enum: Autodesk.Revit.DB.TessellatedBuildIssueType
source: html/b9f37bb0-1c2b-0fe9-a4e8-5a49d2b9b7ac.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssueType.AllFine

No issues were encountered. Issues of this type should not
 be present in TessellatedShapeBuilderResult.